org-files/elisp.org
:PROPERTIES:
:ID:       a7d5680b-e0d9-44ea-9788-40d2e7a139c6
:END:
#+title: elisp
#+STARTUP: show2levels
#+filetags: code:emacs
#+date: <2023-09-04 lun 12:33>

Emacs Lisp es un dialecto del lenguaje de programación Lisp que se usa en los editores GNU Emacs y XEmacs. Emacs Lisp es a veces llamado Elisp, lo cual tiene el riesgo de llevar a confundirlo con otro dialecto de Lisp que tiene el mismo nombre.

La mayoría de las funciones de edición de Emacs vienen de código escrito en Lisp; el resto está escrito en C. Los usuarios que deseen personalizar o extender las funcionalidades de Emacs pueden escribir código en Emacs Lisp.

*** Variables
  - Declarar Variable global -> (setq variable valor)

*** Archivo
  - Escribir a un archivo -> (write-region "loquesea" nil "~/archivo")
  - Añadir a un archivo -> (append-to-file "loquesea" nil "~/archivo")

*** Shell-command
  - Permitir el uso de alias ([[https://stackoverflow.com/questions/12224909/is-there-a-way-to-get-my-emacs-to-recognize-my-bash-aliases-and-custom-functions][Info]])
Hay que añadir las siguientes variables en el archivo de configuración principal
#+begin_src elisp
  (setq explicit-shell-file-name "/bin/bash")
  (setq shell-file-name "bash")                                                                 
  (setq explicit-bash.exe-args '("--noediting" "--login" "-ic"))
  (setq shell-command-switch "-ic")
  (setenv "SHELL" shell-file-name)
#+end_src
