public_html/elisp.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>elisp</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">elisp</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6df3162">1. Variables</a></li>
<li><a href="#orge6e924a">2. Archivo</a></li>
<li><a href="#org5cdec8d">3. Shell-command</a></li>
</ul>
</div>
</div>
<p>
Emacs Lisp es un dialecto del lenguaje de programación Lisp que se usa en los editores GNU Emacs y XEmacs. Emacs Lisp es a veces llamado Elisp, lo cual tiene el riesgo de llevar a confundirlo con otro dialecto de Lisp que tiene el mismo nombre.
</p>

<p>
La mayoría de las funciones de edición de Emacs vienen de código escrito en Lisp; el resto está escrito en C. Los usuarios que deseen personalizar o extender las funcionalidades de Emacs pueden escribir código en Emacs Lisp.
</p>

<div id="outline-container-org6df3162" class="outline-2">
<h2 id="org6df3162"><span class="section-number-2">1.</span> Variables</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Declarar Variable global -&gt; (setq variable valor)</li>
</ul>
</div>
</div>

<div id="outline-container-orge6e924a" class="outline-2">
<h2 id="orge6e924a"><span class="section-number-2">2.</span> Archivo</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Escribir a un archivo -&gt; (write-region "loquesea" nil "~/archivo")</li>
<li>Añadir a un archivo -&gt; (append-to-file "loquesea" nil "~/archivo")</li>
</ul>
</div>
</div>

<div id="outline-container-org5cdec8d" class="outline-2">
<h2 id="org5cdec8d"><span class="section-number-2">3.</span> Shell-command</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Permitir el uso de alias (<a href="https://stackoverflow.com/questions/12224909/is-there-a-way-to-get-my-emacs-to-recognize-my-bash-aliases-and-custom-functions">Info</a>)</li>
</ul>
<p>
Hay que añadir las siguientes variables en el archivo de configuración principal
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> explicit-shell-file-name <span style="color: #95e454;">"/bin/bash"</span>)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> shell-file-name <span style="color: #95e454;">"bash"</span>)                                                                 
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> explicit-bash.exe-args '(<span style="color: #95e454;">"--noediting"</span> <span style="color: #95e454;">"--login"</span> <span style="color: #95e454;">"-ic"</span>))
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> shell-command-switch <span style="color: #95e454;">"-ic"</span>)
(setenv <span style="color: #95e454;">"SHELL"</span> shell-file-name)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-09-04 lun 12:33</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
